[
    {
        "id": 1,
        "name": "Buttery Cabbage-and-Sausage Pasta",
        "img": "https://www.foodandwine.com/thmb/N2PS34bI-DkSaGu0IjJogJGKNJ4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Buttery-Cabbage-And-Sausage-Pasta-FT-RECIPE0923-06944fcdd36d489c806e392688b716b9.jpg",
        "url": "https://www.youtube.com/watch?v=3KKECByewJg",
        "category":"Pasta",
        "time": "1 hr",
        "ingredients": [
            "1 tablespoon olive oil",
            "1 pound mild italian sausage, casings removed",
            "6 tablespoons unsalted butter, divided",
            "1 medium-size yellow onion, thinly sliced (about 2 1/4 cups)",
            "4 medium garlic cloves",
            "1 teaspoon fennel seeds",
            "1/4 teaspoon crushed red pepper, plus more for garnish",
            "1 small (2-pound) head green cabbage, quartered, cored, and finely shredded (about 8 packed cups)",
            "2 teaspoons kosher salt",
            "Water, as needed",
            "16 ounces uncooked gemelli pasta or other short pasta",
            "3 ounces Parmigiano-Reggiano cheese, grated (about 3/4 cup)",
            "3 tablespoons fresh lemon juice (from 2 lemons)",
            "Chopped fresh dill, for garnish"
        ],
        "howto": [
            "Heat oil in a 14-inch skillet over medium-high. Add sausage; cook, stirring occasionally to break up into small pieces, until browned and cooked through, 6 to 10 minutes. Transfer sausage to a plate; reserve drippings in skillet.",
            "Add 1/4 cup butter to drippings in skillet; cook over medium-high, stirring often, until melted, about 30 seconds. Add onion, garlic, fennel seeds, and crushed red pepper; cook, scraping up any browned bits in skillet, until fragrant and slightly softened, about 3 minutes. Stir in cabbage and salt. Cook, stirring often, until mixture is very soft and browned, about 20 minutes, adding water, 2 to 4 tablespoons at a time, as needed to deglaze and prevent browned bits from burning. During final 5 minutes of cook time, use a spatula to smash and break up pieces of cabbage.",
            "Meanwhile, bring a large pot of salted water to a boil over high. Add pasta; cook according to package directions for al dente, stirring occasionally. Drain, reserving 2 cups pasta cooking liquid.",
            "Add cooked pasta, reserved sausage, 1 cup reserved pasta cooking liquid, and remaining 2 tablespoons butter to cabbage mixture in skillet. Cook over medium, stirring constantly, until liquid thickens to lightly coat pasta, about 3 minutes. Add cheese and lemon juice; cook, stirring constantly, until saucy, 1 to 2 minutes, adding up to remaining 1 cup cooking liquid if needed to achieve desired sauce consistency. Spoon into 6 bowls. Garnish with dill, additional crushed red pepper, and additional cheese."
        ]
    },
    {
        "id": 2,
        "name": "Ossola-Style Gnocchi",
        "img": "https://www.foodandwine.com/thmb/22wALnhpoKw9EDXm_vUNvyxU6v4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Ossola-Style-Gnocchi-with-Sage-Butter-Sauce-FT-RECIPE0122-f2c01f2e25ad42aeb3b6e70f45c6c389.jpg",
        "url": "https://www.youtube.com/watch?v=3sUJwjvmzk8",
        "category":"Vegetable",
        "time": "1 hr 5 mins",
        "ingredients": [
            "2 medium-size (10 ounce) russet potatoes, scrubbed and patted dry",
            "1 small butternut squash (about 1 pound 12 ounces)",
            "1/4 cup plus 2 teaspoons olive oil, divided",
            "1/4 teaspoon black pepper",
            "5 teaspoon kosher salt, divided, plus more to taste",
            "1 cup chestnut flour (about 3 1/2 ounces)",
            "3/4 cup Italian-style 00 flour (about 3 1/2 ounces) or all-purpose flour",
            "2 large egg yolks, beaten",
            "2 5/8 ounces Grana Padano cheese or Parmigiano-Reggiano cheese grated (about 3/4 cup)",
            "2 pinches of freshly grated nutmeg, divided",
            "2/3 cup unsalted butter (5 1/3 ounces)",
            "12 fresh sage leaves"
        ],
        "howto": [
            "Preheat oven to 425°F. Prick potatoes all over with a fork; place on a rimmed baking sheet lined with parchment paper. Roast in preheated oven 15 minutes.",
            "Meanwhile, trim top and bottom from unpeeled squash; cut squash in half cross- wise where neck meets base. Place both halves upright on cutting board on widest flat cut side; carefully cut in half from top to bottom. Scoop out and discard seeds. Rub squash all over with 2 teaspoons oil; sprinkle evenly with pepper and 1/4 teaspoon salt.",
            "Arrange squash, cut sides down, around potatoes on baking sheet. Return to oven, and roast at 425°F until squash and potatoes are easily pierced with a knife, about 45 minutes. Remove from oven; let cool slightly, about 10 minutes.",
            "Cut potatoes in half lengthwise. Scoop out potato flesh, and pass through a ricer into a medium bowl. (Alternatively, mash potato flesh using a potato masher in a medium bowl until smooth.) Spread potatoes on a large plate lined with paper towels. Pat dry with paper towels. Set aside 1 1/2 cups packed mashed potatoes. Reserve remaining potatoes for another use.",
            "Scoop flesh from cooled squash into a medium bowl; mash until smooth. Spread squash across a large plate lined with paper towels. Pat dry with paper towels to remove as much excess moisture as possible to yield 1 1/4 cups mashed squash.",
            "Whisk together chestnut flour, 00 flour, and 1 teaspoon salt in a large bowl; create a large well in center of mixture. Add egg yolks, half of potatoes, half of squash, half of grated cheese, and a pinch of nutmeg to well. Repeat layering with remaining potatoes, squash, cheese, and nutmeg.",
            "Gently fold flour mixture into potato mix- ture until a shaggy mass forms. Transfer dough to a work surface. Knead briefly until evenly incorporated.",
            "Line two large baking sheets with parchment paper, and dust parchment with 00 flour. Place a small bowl of 00 flour near workstation. Cut dough evenly into 8 wedges. Dust wedges with 00 flour. Gently roll 1 dough wedge into a 3/4-inch-thick rope. Cut rope crosswise into 3/4-inch-long gnocchi. Transfer gnocchi to prepared baking sheets. Repeat with remaining dough wedges.",
            "Bring a large pot of water to a boil over high. While water comes to a boil, heat butter in a large skillet over medium just until butter starts to foam. Add sage and remaining 1/4 teaspoon salt; cook, stirring often, until foam subsides and sage is sizzling, about 3 minutes. Pour mixture into a small bowl. Set aside until ready to use.",
            "Salt boiling water, and gently stir in half of gnocchi. Cook, undisturbed, until gnocchi float to surface, 2 to 3 minutes.",
            "While gnocchi cook, heat 2 tablespoons oil in a large nonstick skillet over medium-high. Using a slotted spoon or a spider, transfer gnocchi to skillet. Cook, undisturbed, until gnocchi bottoms are crisp, about 4 minutes. Flip gnocchi, and cook until other side is crisp, about 2 minutes. Transfer gnocchi to a plate. Do not wipe skillet clean. Repeat with remaining 2 tablespoons oil and remaining gnocchi.",
            "Return all cooked gnocchi to skillet; pour butter mixture over gnocchi, and stir to coat. Season with additional salt to taste. Divide gnocchi, butter sauce, and fried sage evenly among plates. Garnish with additional cheese."
        ]
    },
    {
        "id": 3,
        "name": "Ricotta Polpette",
        "img": "https://www.foodandwine.com/thmb/5i-bxEJFaWTU4bG7Y7pIhe89BFg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Ricotta-Polpette-FT-RECIPE0723-420aee27e58a410080366740cd1aa08c.jpg",
        "url": "https://www.youtube.com/watch?v=cStTu2HayGY",
        "category":"Vegetable",
        "time": "1 hr 45 mins",
        "ingredients": [
            "2 cups whole-milk ricotta cheese (from 2 [15-ounce] containers), drained",
            "2 large eggs, lightly beaten",
            "4 ounces Parmesan cheese, grated (about 1 cup), plus more for serving",
            "1/2 cup chopped fresh basil",
            "1 1/2 teaspoons kosher salt",
            "1/2 teaspoon black pepper",
            "1/2 teaspoon grated garlic (from 2 medium garlic cloves)",
            "1 1/4 cups dry breadcrumbs, plus more as needed",
            "4 medium garlic cloves",
            "1/4 cup olive oil, plus more for drizzling",
            "1/4 teaspoon crushed red pepper flakes",
            "1 (28-ounce) can whole peeled San Marzano plum tomatoes, crushed by hand",
            "1 cup loosely packed fresh basil leaves, plus small leaves for garnish",
            "1/2 cup water",
            "1/2 teaspoon kosher salt"
        ],
        "howto": [
            "If ricotta is watery, spoon onto a few layers of paper towels and spread to an even layer; place more paper towels on top. Gently press down on ricotta to remove excess moisture. Remove and discard top layer of paper towels. Lift paper towel by the sides and dump ricotta into a large bowl, using paper towel to shake leftover pieces of ricotta into bowl. Stir in eggs, Parmesan cheese, basil, salt, pepper, and garlic until thoroughly blended and smooth. Stir in breadcrumbs until combined. (Depending on ricotta, mixture may be loose but should be able to shape into balls that hold together. If not, add additional breadcrumbs, 1/4 cup at a time, as needed.)",
            "Shape mixture into 24 balls (about 2 tablespoons each), and place on a baking sheet lined with parchment paper. Refrigerate, uncovered, 1 hour.",
            "Place garlic, oil, and crushed red pepper flakes in a small saucepan over medium-low. Once garlic starts to sizzle, reduce heat to low. Cook, stirring occasionally, until garlic is tender, 10 to 12 minutes. Remove saucepan from heat, and mash garlic cloves using a fork. Transfer garlic mixture to a large Dutch oven, and stir in tomatoes, basil, water, and salt. Bring to a simmer over medium. Simmer, stirring occasionally, until slightly thickened, 12 to 15 minutes, reducing heat to low as needed to prevent boiling.",
            "Stir Tomato Sauce, and immediately add Ricotta Polpette to simmering sauce. Cover and reduce heat to low. Cook, gently shaking Dutch oven occasionally, until polpette are tender and cooked through, 12 to 15 minutes. Remove from heat.",
            "Using a serving spoon, divide polpette and sauce evenly among 4 shallow bowls. Drizzle with additional oil, and sprinkle with additional Parmesan cheese. Garnish with small basil leaves."
        ]
    },
    {
        "id": 4,
        "name": "Shrimp Cocktail",
        "img": "https://www.foodandwine.com/thmb/yLdadRm5VTGqTwtNDqiyP-gB0rk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/grilled-shrimp-cocktail-with-fresh-tomato-cocktail-sauce-FT-RECIPE0822-2000-c40f2d7d2c6a47069c54cd7a180cbc46.jpg",
        "url": "https://www.youtube.com/watch?v=hLsj8i3ihTo",
        "category":"Shrimp",
        "time": "30 mins",
        "ingredients": [
            "1 1/2 pounds large peeled, deveined raw shrimp, tail-on",
            "1 teaspoon crushed red pepper",
            "1 1/2 tablespoons grated lemon zest, plus 1 tablespoon fresh juice (from 2 lemons), divided",
            "4 tablespoons extra-virgin olive oil, divided, plus more for bread slices and drizzling",
            "2 tablespoons grated garlic (from 8 large garlic cloves), divided",
            "2 tablespoons kosher salt, divided, plus more to taste",
            "1 teaspoon black pepper, divided",
            "1/3 cup julienne-cut smoked sun-dried tomatoes (from 1 [3-ounce] package), chopped (about 1/3 cup)",
            "3 tablespoons mild or spicy harissa paste (from 1 [10-ounce] jar) (such as Mina)",
            "1 1/2 tablespoons sherry vinegar",
            "2 cups chopped red tomato (from 1 large [12-ounce] tomato)",
            "2 teaspoons hot sauce",
            "1 teaspoon Worcestershire sauce",
            "2 tablespoons finely chopped fresh flat-leaf parsley, divided",
            "Cooking spray",
            "12 (1/4-inch-thick) baguette slices (3 ounces total)"
        ],
        "howto": [
            "Pat shrimp dry using paper towels; place shrimp in a large bowl. Add crushed red pepper, lemon juice, 3 tablespoons of the oil, 1 tablespoon of the lemon zest, 1 tablespoon of the garlic, 1 teaspoon of the salt, and 1/2 teaspoon of the black pepper; toss to coat shrimp evenly. Let stand at room temperature for 20 minutes.",
            "While shrimp marinates, heat remaining 1 tablespoon oil in a small skillet over medium. Add sun-dried tomatoes, harissa paste, and remaining 1 tablespoon garlic. Cook, stirring often, until tomatoes are tender and garlic is soft and fragrant, about 2 minutes. Stir in sherry vinegar. Transfer sun-dried tomato mixture and chopped tomato to food processor bowl. Pulse until mixture is coarsely chopped and uniformly blended but not smooth, 10 to 12 pulses, stopping to scrape down sides of bowl as needed. Stir in hot sauce, Worcestershire sauce, 1 tablespoon of the chopped parsley, and remaining 1/2 tablespoon lemon zest. Season with additional salt to taste; set cocktail sauce aside.",
            "Heat a grill pan over high. Lightly coat grill pan with cooking spray. Brush both sides of sliced bread with additional oil. Grill until toasted and lightly charred on edges, 1 to 2 minutes per side. Transfer to a platter.",
            "Sprinkle marinated shrimp evenly with remaining 1 teaspoon salt and 1/2 teaspoon black pepper. Add shrimp to grill pan; grill until opaque and lightly charred, about 2 minutes per side. Transfer to platter with bread. Spoon cocktail sauce into a bowl, and place alongside shrimp and bread on platter. Sprinkle shrimp, bread, and cocktail sauce evenly with remaining 1 tablespoon parsley; drizzle with additional oil. Serve."
        ]
    }
]